#ifndef __VIRTUAL_MCU_WAKEUP_H__
#define __VIRTUAL_MCU_WAKEUP_H__

/**--------------------------------------模块唤醒接口说明--------------------------------------------------
 ----------------------------------------------------------------------------------------------------------
	                 本模块内置12路唤醒通道，可通过任意GPIO设置唤醒口，如下函数操作
 ----------------------------------------------------------------------------------------------------------
 ----------------------------------------------------------------------------------------------------------*/
#define   WAKEUP_RISING_EDGE         0
#define   WAKEUP_FALLING_EDGE        1
#define   WAKEUP_BOTH_EDGE           2
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_set_wakeup_io
    参数  ：u8 pullup_down_enable,u8 edge,u8 gpio
    说明  ：初始化唤醒IO口
    * @param pullup_down_enable   : 内部上拉或者内部下拉使能，例如下降沿触发，就使能内部上拉，上升沿触发，就使能内部下拉
    * @param edge                 : 设置上升沿触发WAKEUP_RISING_EDGE，下降沿触发WAKEUP_FALLING_EDGE，或者上升和下降沿都可以触发WAKEUP_BOTH_EDGE
    * @param gpio                 : 设置唤醒IO口，如 IO_PORTB_01
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
void polyc_set_wakeup_io(u8 pullup_down_enable,u8 edge,u8 gpio);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_power_off_io_keep
    参数  ：u8 gpio
    说明  ：进入睡眠之前设置维持的IO口
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
void polyc_power_off_io_keep(u8 gpio);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_power_off_to_sleep
    参数  ：
    说明  ：关机进入低功耗模式，芯片本身只剩下3uA
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
void polyc_power_off_to_sleep(void);

#endif
