#ifndef __VIRTUAL_MCU_GPIO_H__
#define __VIRTUAL_MCU_GPIO_H__

/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_gpio_set_dir，设置gpio输入输出
    参数  ：u8 gpio,u8 value
    说明  ：
    * @param gpio  : GPIO口
    * @param value : GPIO有效值
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
extern void polyc_gpio_set_dir(u8 gpio,u8 value);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_gpio_set_out，设置gpio输出值
    参数  ：u8 gpio,u8 value
    说明  ：
    * @param gpio  : GPIO口
    * @param value : GPIO有效值
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
extern void polyc_gpio_set_out(u8 gpio,u8 value);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_gpio_set_pull_up，设置gpio上拉
    参数  ：u8 gpio,u8 value
    说明  ：
    * @param gpio  : GPIO口
    * @param value : GPIO有效值
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
extern void polyc_gpio_set_pull_up(u8 gpio,u8 value);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_gpio_set_pull_down，设置gpio下拉
    参数  ：u8 gpio,u8 value
    说明  ：
    * @param gpio  : GPIO口
    * @param value : GPIO有效值
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
extern void polyc_gpio_set_pull_down(u8 gpio,u8 value);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_gpio_set_hd，设置gpio强驱动，所有接口上电默认关闭，打开输出电流大
    参数  ：u8 gpio,u8 value
    说明  ：
    * @param gpio  : GPIO口
    * @param value : GPIO有效值
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
extern void polyc_gpio_set_hd(u8 gpio,u8 value);
/**--------------------------------------------------------------------------------------------------------
    函数名：polyc_gpio_read，设置gpio读取有效值
    参数  ：u8 gpio,u8 value
    说明  ：
    * @param gpio  : GPIO口
    返回值：void
 ----------------------------------------------------------------------------------------------------------*/
extern u8 polyc_gpio_read(u8 gpio);



#endif
